
# %%
# Практическое задание: Напишите скрипт для выполнения следующих трех операций над заданным списком.

# Получите доступ к третьему элементу списка.
# Длина списка: Выведите общее количество элементов.
# Проверьте, пуст ли список.

sample_list = [10, 20, 30, 40, 50]

print(f'Third element: {sample_list[2]}')
print(f'Length of list: {len(sample_list)}')


is_empty = len(sample_list) == 0
print(f'Is the list empty?: {is_empty}')


# %%
# Упражнение 2. Выполните манипуляции со списками.
# Практическое задание: Возьмите данный список и измените его с помощью пяти конкретных действий:

# Изменить элемент:  Измените второй элемент списка на 200 и выведите обновленный список.
# Добавить элемент:  Добавьте 600 в конец списка и выведите новый список.
# Вставка элемента:  Вставьте число 300 на третью позицию (индекс 2) списка и выведите результат.
# Удаление элемента (по значению):  Удалите элемент 600 из списка и выведите список.
# Удаление элемента (по индексу):  Удалите элемент с индексом 0 из списка. Выведите список.


sample_list = [100, 50, 400, 500]

#1 Change element
sample_list[1] = 200
print(f'Update(change): {sample_list}')

#2 Append element 
sample_list.append(600)
print(f'Update (Append): {sample_list}')

#3 Insert element
sample_list.insert(2, 300)
print(f'Update (Insert): {sample_list}')

del sample_list[4]
print(sample_list)

del sample_list[0]
print(sample_list)
